#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.fourkeys.module.gh_log_handler_registry_url.data.external.env_override[0]: Reading...
module.fourkeys.module.test_artifact_registry_url_demo.data.external.env_override[0]: Reading...
module.fourkeys.module.gcloud_build_batch_events_bq_writer.data.external.env_override[0]: Reading...
module.fourkeys.module.gcloud_build_batch_events_bq_writer.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.data.archive_file.events_bq_writer_source: Reading...
module.fourkeys.data.archive_file.demo: Reading...
module.fourkeys.data.archive_file.gh_log_handler_2: Reading...
module.fourkeys.module.gh_log_handler_registry_url.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.module.test_artifact_registry_url_demo.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.data.archive_file.gh_log_handler_2: Read complete after 0s [id=681d3a5f45e8b5003f5c14c09a8b9817b3cd6c1a]
module.fourkeys.data.archive_file.events_bq_writer_source: Read complete after 0s [id=6f2d6c347b7f4e8eba5d12946eda38b1d84b2af7]
module.fourkeys.data.archive_file.demo: Read complete after 0s [id=6c1bb5ba27bd83aabb22cffba9470a9ca91073b6]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.null_resource.run_command[0]: Refreshing state... [id=2671861280509006243]
module.fourkeys.module.gh_log_handler_registry_url.null_resource.run_destroy_command[0]: Refreshing state... [id=1933169001799140754]
module.fourkeys.module.gh_log_handler_registry_url.null_resource.run_command[0]: Refreshing state... [id=6492058184969745213]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.null_resource.run_destroy_command[0]: Refreshing state... [id=7501264970071068882]
module.fourkeys.module.test_artifact_registry_url_demo.null_resource.run_destroy_command[0]: Refreshing state... [id=795832857450092111]
module.fourkeys.module.test_artifact_registry_url_demo.null_resource.run_command[0]: Refreshing state... [id=6469184184091429422]
module.fourkeys.data.google_project.project: Reading...
module.fourkeys.google_storage_bucket_iam_member.destination_bucket_access_logs: Refreshing state... [id=b/off-net-dev-gh-audit-log-archieve-local/roles/storage.admin/serviceAccount:project-541105984323@storage-transfer-service.iam.gserviceaccount.com]
module.fourkeys.google_storage_bucket.events_archieve_local: Refreshing state... [id=off-net-dev-events-archieve-local]
module.fourkeys.data.google_storage_transfer_project_service_account.logs: Reading...
module.fourkeys.google_storage_bucket.trigger_bucket: Refreshing state... [id=batch-gh-audit-logs]
module.fourkeys.google_storage_bucket.gh_audit_log_archieve_local: Refreshing state... [id=off-net-dev-gh-audit-log-archieve-local]
module.fourkeys.google_storage_bucket.batch_gh_log_function_bucket: Refreshing state... [id=off-net-dev-batch-gh-log-function]
module.fourkeys.google_bigquery_dataset.dataset: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys]
module.fourkeys.google_cloud_run_service.batch_logs_bq_writer_demo: Refreshing state... [id=locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-logs-bq-writer-demo]
module.fourkeys.google_storage_bucket_iam_member.source_bucket_access_logs: Refreshing state... [id=b/off-net-dev-gh-audit-log-station-local/roles/storage.admin/serviceAccount:project-541105984323@storage-transfer-service.iam.gserviceaccount.com]
module.fourkeys.google_storage_bucket.gh_audit_log_station_local: Refreshing state... [id=off-net-dev-gh-audit-log-station-local]
module.fourkeys.data.google_storage_bucket.gh_audit_log_station_local: Reading...
module.fourkeys.data.google_storage_bucket.gh_audit_log_archieve_local: Reading...
module.fourkeys.google_storage_bucket.events_station_local: Refreshing state... [id=off-net-dev-events-station-local]
module.fourkeys.google_cloud_run_service.batch_events_bq_writer: Refreshing state... [id=locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-events-bq-writer]
module.fourkeys.data.google_project.project: Read complete after 0s [id=projects/off-net-dev]
module.fourkeys.google_eventarc_trigger.gh_logs_trigger_demo: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/triggers/gh-logs-trigger-demo]
module.fourkeys.google_storage_transfer_job.batch_logs_transfer_job: Refreshing state... [id=off-net-dev/2870788994826366552]
module.fourkeys.google_bigquery_table.batch_logs: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys/tables/batch_logs]
module.fourkeys.google_bigquery_table.batch_events: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys/tables/batch_events]
module.fourkeys.data.google_storage_bucket.gh_audit_log_station_local: Read complete after 0s [id=off-net-dev-gh-audit-log-station-local]
module.fourkeys.data.google_storage_transfer_project_service_account.logs: Read complete after 0s [id=project-541105984323@storage-transfer-service.iam.gserviceaccount.com]
module.fourkeys.google_eventarc_trigger.primary: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/triggers/name]
module.fourkeys.data.google_storage_bucket.gh_audit_log_archieve_local: Read complete after 0s [id=off-net-dev-gh-audit-log-archieve-local]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.fourkeys.google_cloud_run_service.batch_events_bq_writer will be updated in-place
  ~ resource "google_cloud_run_service" "batch_events_bq_writer" {
        id                         = "locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-events-bq-writer"
        name                       = "batch-events-bq-writer"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                    # (3 unchanged attributes hidden)

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m" -> null
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fourkeys.google_cloud_run_service.batch_logs_bq_writer_demo will be updated in-place
  ~ resource "google_cloud_run_service" "batch_logs_bq_writer_demo" {
        id                         = "locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-logs-bq-writer-demo"
        name                       = "batch-logs-bq-writer-demo"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                    # (3 unchanged attributes hidden)

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m" -> null
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fourkeys.google_cloud_run_service.batch_logs_handler will be created
  + resource "google_cloud_run_service" "batch_logs_handler" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "northamerica-northeast1"
      + name                       = "batch-logs-handler"
      + project                    = "off-net-dev"
      + status                     = (known after apply)

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/minScale" = "1"
                  + "client.knative.dev/user-image"    = "northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/gh_log_handler_url_2:681d3a5f45e8b5003f5c14c09a8b9817b3cd6c1a"
                  + "run.googleapis.com/client-name"   = "cloud-console"
                }
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = "dora-wif@off-net-dev.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/gh_log_handler_url_2:681d3a5f45e8b5003f5c14c09a8b9817b3cd6c1a"
                  + name  = (known after apply)

                  + env {
                      + name  = "project-name"
                      + value = "off-net-dev"
                    }

                  + resources {
                      + limits = {
                          + "memory" = "1024Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # module.fourkeys.google_eventarc_trigger.gh_logs_handler will be created
  + resource "google_eventarc_trigger" "gh_logs_handler" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + event_data_content_type = (known after apply)
      + id                      = (known after apply)
      + location                = "northamerica-northeast1"
      + name                    = "gh-logs-handler-eventrac"
      + project                 = "off-net-dev"
      + service_account         = "dora-wif@off-net-dev.iam.gserviceaccount.com"
      + terraform_labels        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)

      + destination {
          + cloud_run_service {
              + path    = "/persist_data"
              + region  = "northamerica-northeast1"
              + service = "batch-logs-handler"
            }
        }

      + matching_criteria {
          + attribute = "bucket"
          + value     = "batch-gh-audit-logs"
        }
      + matching_criteria {
          + attribute = "type"
          + value     = "google.cloud.storage.object.v1.finalized"
        }
    }

  # module.fourkeys.module.gh_log_handler_registry_url.null_resource.run_command[0] must be replaced
-/+ resource "null_resource" "run_command" {
      ~ id       = "6492058184969745213" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "arguments"             = "67fad27767652ea334b91772be802d23" -> "b5533b9e69191edcdd2e781b127adc83"
          ~ "create_cmd_body"       = "builds submit ../batch_gh_audit_log --tag=northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/gh_log_handler_url:681d3a5f45e8b5003f5c14c09a8b9817b3cd6c1a --project=off-net-dev --gcs-log-dir=gs://tf-cloud-build-gh-logs-handler" -> "builds submit ../batch_gh_audit_log --tag=northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/gh_log_handler_url_2:681d3a5f45e8b5003f5c14c09a8b9817b3cd6c1a --project=off-net-dev --gcs-log-dir=gs://tf-cloud-build-gh-logs-handler"
            # (3 unchanged elements hidden)
        }
    }

  # module.fourkeys.module.gh_log_handler_registry_url.null_resource.run_destroy_command[0] must be replaced
-/+ resource "null_resource" "run_destroy_command" {
      ~ id       = "1933169001799140754" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "destroy_cmd_body"       = "container images delete northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/gh_log_handler_url:6939e6959beea9bc74b629e29e3f7ff7f9e60d7f --quiet" -> "container images delete northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/gh_log_handler_url_2:681d3a5f45e8b5003f5c14c09a8b9817b3cd6c1a --quiet"
            # (2 unchanged elements hidden)
        }
    }

Plan: 4 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @lendly-telus-com, Action: `pull_request`*